// https://www.runoob.com/mysql/mysql-data-types.html
// MySQL 数据类型
// MySQL中定义数据字段的类型对你数据库的优化是非常重要的。

// MySQL支持多种类型，大致可以分为三类：数值、日期/时间和字符串(字符)类型。
export default {
  // ================  数值 =========================
  tinyInt: '"integer(0, $$)"', //	1 字节	(-128，127)	(0，255)	小整数值
  smallInt: '"integer(0, $$)"', //	2 字节	(-32 768，32 767)	(0，65 535)	大整数值
  mediumInt: '"integer(0, $$)"', //	3 字节	(-8 388 608，8 388 607)	(0，16 777 215)	大整数值
  int: '"integer(0, $$)"',
  integer: '"integer(0, $$)"', // 4 字节	(-2 147 483 648，2 147 483 647)	(0，4 294 967 295)	大整数值
  bigInt: '"integer(0, $$)"', // 8 字节	(-9,223,372,036,854,775,808，9 223 372 036 854 775 807)	(0，18 446 744 073 709 551 615)	极大整数值
  float: '"float(0, $$)"', // 4 字节	(-3.402 823 466 E+38，-1.175 494 351 E-38)，0，(1.175 494 351 E-38，3.402 823 466 351 E+38)	0，(1.175 494 351 E-38，3.402 823 466 E+38)	单精度
  // 浮点数值
  double: '"float(60, 100)"', //	8 字节	(-1.797 693 134 862 315 7 E+308，-2.225 073 858 507 201 4 E-308)，0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308)	0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308)	双精度
  // TODO:  DECIMAL: 'double"', // 对DECIMAL(M,D) ，如果M>D，为M+2否则为D+2	依赖于M和D的值	依赖于M和D的值	小数值

  // =====================  日期/时间和 ====================================
  date: '"date"', //		1000-01-01/9999-12-31	YYYY-MM-DD	日期值
  time: '"time"', //		'-838:59:59'/'838:59:59'	HH:MM:SS	时间值或持续时间
  year: '"date("YYYY")"', //	1	1901/2155	YYYY	年份值
  datetime: '"datetime"', //		1000-01-01 00:00:00/9999-12-31 23:59:59	YYYY-MM-DD HH:MM:SS	混合日期和时间值
  timestamp: '"datetime("T")"', // timeStamp

  // ==========================  字符串类型 ===========================
  char: '"string(4,255)"', // 0-255字节	定长字符串
  varchar: '"string()"', // 0-65535 字节	变长字符串
  tinyBlob: '', //	0-255字节	不超过 255 个字符的二进制字符串
  tinyText: '', //	0-255字节	短文本字符串
  blob: '', //	0-65 535字节	二进制形式的长文本数据
  text: '"paragraph"', // 0-65 535字节	长文本数据
  mediumBlob: '"paragraph"', //	0-16 777 215字节	二进制形式的中等长度文本数据
  mediumText: '"paragraph"', //	0-16 777 215字节	中等长度文本数据
  longBlob: '', //	0-4 294 967 295字节	二进制形式的极大文本数据
  longText: '"paragraph"', //	0-4 294 967 295字节	极大文本数据
  enum: '[$$]', //
}
